import os

TOKEN = os.environ.get('TOKEN', '')  # Берем из переменных окружения Render

# Планеты и их типы
PLANET_TYPES = [
    {"emoji": "🏝️", "name": "Умеренный", "climate": "Умеренный", "difficulty": "Легко", "image_idx": 0},
    {"emoji": "🏜️", "name": "Засушливый", "climate": "Засушливый", "difficulty": "Легко", "image_idx": 1},
    {"emoji": "🌊", "name": "Водный", "climate": "Влажный", "difficulty": "Средне", "image_idx": 2},
    {"emoji": "🏔️", "name": "Прохладный", "climate": "Холодный", "difficulty": "Средне", "image_idx": 3},
    {"emoji": "⛰️", "name": "Холодный", "climate": "Очень холодный", "difficulty": "Сложно", "image_idx": 4},
    {"emoji": "🗻", "name": "Ледяной", "climate": "Арктический", "difficulty": "Сложно", "image_idx": 5},
    {"emoji": "🌋", "name": "Горячий", "climate": "Жаркий", "difficulty": "Сложно", "image_idx": 6}
]

# Картинки планет
PLANET_IMAGES = [
    "https://i.ibb.co/k64Qq4QT/IMG-7210.jpg",  # 🏝️
    "https://i.ibb.co/FqmkmFck/IMG-7213.jpg",  # 🏜️
    "https://i.ibb.co/60nxpZBL/IMG-7214.jpg",  # 🌊
    "https://i.ibb.co/BH5011gy/IMG-7215.jpg",  # 🏔️
    "https://i.ibb.co/BHGN2Ltm/IMG-7216.jpg",  # ⛰️
    "https://i.ibb.co/twJNncSq/IMG-7217.jpg",  # 🗻
    "https://i.ibb.co/Kzq641w8/IMG-7218.jpg"   # 🌋
]

# Картинки путешествий
TRAVEL_IMAGES = [
    "https://i.ibb.co/bRg4N9Yj/IMG-7438.png",  # 🏝️
    "https://i.ibb.co/pvgbt58F/IMG-7439.png",  # 🏜️
    "https://i.ibb.co/chzMZL8m/IMG-7440.png",  # 🌊
    "https://i.ibb.co/8gQ9s3Dt/IMG-7441.png",  # 🏔️
    "https://i.ibb.co/DPyZH2Jj/IMG-7442.png",  # ⛰️
    "https://i.ibb.co/hhv7mGL/IMG-7443.png",  # 🗻
    "https://i.ibb.co/Kph2Vf8W/IMG-7444.png"   # 🌋
]

# Названия планет
PLANET_NAMES = [
    "Абладзек", "Адо", "Альбаррио", "Албанин", "Аирам", "Аноат", "Ансурёр",
    "Антемеридиан", "Антос", "Апаро", "Астал", "Арканис", "Атривис", "Аурил",
    "Баджик", "Белдерон", "Босф", "Бразант", "Вацта", "Велкар", "Вераги",
    "Виргилийский", "Виргенда", "Ворзыд", "Галов", "Гардадзи", "Гордианский предел",
    "Даил", "Далонбиан", "Д'Астан", "Деметрас", "Джавин", "Джоспро", "Икеномин",
    "Иминис", "Индрексу", "Кадавин", "Кадемиму", "Какани", "Каламари", "Каларон",
    "Канз", "Кассандер", "Катарло", "Катол", "Кваймар", "Квели", "Квенс", "Квесс",
    "Квестал", "Квиилура", "Келдрат", "Кибилини", "Клацис", "Колунда", "Кор'рик",
    "Корва", "Ксаппи", "Лахара", "Лол", "Лямбда", "Мандалорский", "Маягил", "Мерам",
    "Мерел", "Меридиан", "Модделл", "Моршдин", "Нембус", "Нилгаард", "Нуири",
    "Обтрекста", "Оджостер", "Опловис", "Оричо", "Пармел", "Пармик", "Перинн",
    "Портмоук", "Раиобалло", "Рсейк", "Салласт", "Самикс", "Санбра", "Сарин",
    "Сесвенна", "Скайн", "Слуис", "Спадья", "Спар", "Сугаи", "Суджимис", "Сумитра",
    "Сулорин", "Тадрин", "Тамарин", "Тарабба", "Тендраннан", "Тарин", "Тесме",
    "Трасибьюл", "Турис", "Торч", "Траган", "Тракс", "Трилон", "Тангра", "Уил",
    "Фарстей", "Феллим", "Фиррерре", "Фусай", "Хадар", "Хомон", "Цегул", "Чорлиан",
    "Шандола", "Шатаум", "Шивал", "Элруд", "Экзарга", "Ярис", "Союзный Тион"
]

# Локации для каждого типа планеты
LOCATIONS = {
    "🏝️": ["🌳 Лес Секвой", "🪨 Скалистая долина", "🕋 Древняя Фабрика"],
    "🏜️": ["🌵 Бескрайние дюны", "🛖 Поселение Мос-Гранде", "🌋 Мертвые земли"],
    "🌊": ["🌊 Местные Водоемы", "🍃 Суша", "🌪️ Ветреные земли"],
    "🏔️": ["🪨 Скалистая долина", "🏭 Фабрика Кораблей", "🏔️ Снежные пики"],
    "⛰️": ["❄️ Снежные дюны", "📡 Заброшенная станция", "⛏️ Рудники"],
    "🗻": ["🪼 Окрестности", "🧊 Ледники", "🌫️ Бескрайние пустоши"],
    "🌋": ["🏵️ Огненные леса", "🏛️ Древний Храм Джедаев", "🪾 Мертвая долина"]
}

# Имена наемников
MERC_NAMES = ["Гур", "Джар", "Минудо", "Гоцек", "Гомадо", "Боксо", "Гето", "Грит", "Гриф", "Грирт", "Рож", "Тарр", "Сендо"]

# Имена вражеских картелей
ENEMY_NAMES = ["Черные звезды", "Синдикат Клоунов", "Картель Хаттов", "Ударная Сила"]

# Имена NPC врагов
NPC_TYPES = {
    "tusken": {"name": "Таскенский Рейдер", "emoji": "🧥", "min_hp": 11, "max_hp": 19, "min_dmg": 3, "max_dmg": 5},
    "tusken_leader": {"name": "Таскенский Лидер", "emoji": "👘", "min_hp": 15, "max_hp": 30, "min_dmg": 7, "max_dmg": 9},
    "paik": {"name": "Боец Пайков", "emoji": "👽", "min_hp": 13, "max_hp": 21, "min_dmg": 4, "max_dmg": 6},
    "gonch": {"name": "Гончая", "emoji": "🐺", "min_hp": 9, "max_hp": 15, "min_dmg": 5, "max_dmg": 7},
    "vampa": {"name": "Вампа", "emoji": "🐗", "min_hp": 20, "max_hp": 35, "min_dmg": 6, "max_dmg": 9},
    "pig": {"name": "Хотосвинья", "emoji": "🐖", "min_hp": 12, "max_hp": 18, "min_dmg": 3, "max_dmg": 5}
}
